<template>
  <div class="course-sec__plan-keeper">
    <ul class="course-sec__plan-list">
      <li class="course-sec__plan-item">
        <div class="list-number">
          1
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 1: Знакомство с Python
          </h4>
          <article class="course-sec__plan-article">
            Урок содержит базовую информацию, необходимую для успешного старта в сфере разработки на Python, в том числе описание установки интерпретатора в различные ОС и среды разработки. Также в рамках курса приведено описание понятия динамической типизации, особенностей использования арифметических и логических операций. Отдельные разделы урока посвящены способам форматирования строк, следованиям, ветвлениям и циклам. В конце приведён список основных ошибок разработчика и пути их решения.
          </article>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          2
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 2. Встроенные типы и операции с ними
          </h4>
          <article class="course-sec__plan-article">
            В уроке приведено описание ключевых встроенных типов данных, реализованных в Python. Разработчик может выполнять операции с данными традиционных типов, таких как строки, числа, логический тип. Рассматриваются списки, множества, кортежи, словари. Также в рамках урока мы познакомимся с понятиями тернарного оператора и оператора is. Обязательно коснёмся и некоторых операций, выполняемых с данными базовых типов, узнаем о трюках, которые может использовать разработчик для повышения лаконичности кода.
          </article>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          3
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 3. Функции
          </h4>
          <article class="course-sec__plan-article">
            Пришло время познакомиться с механизмом группировки строк кода по блокам — функциям. Они обеспечивают возможность использования этих блоков кода повторно в любой точке программы. Функции могут быть именными и анонимными, принимать параметры и возвращать результат. Важное понятие урока — область видимости переменных. Функции могут документироваться для описания их назначения, принимаемых параметров и возвращаемого результата. Наконец, функции могут быть встроенными и пользовательскими (самописными).
          </article>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          4
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 4. Полезные инструменты
          </h4>
          <article class="course-sec__plan-article">
            Урок посвящён инструментам, которые позволят сделать ваш код более лаконичным, упростить решение многих стандартных задач. В уроке также описаны возможности ряда дополнительных модулей, используемых при написании алгоритмов. Приведены особенности механизма запуска скриптов с параметрами и получения доступа к параметрам из кода программы. Использование представленных инструментов относится к более продвинутому стилю программирования и повышает статус разработчика.
          </article>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          5
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 5. Работа с файлами
          </h4>
          <article class="course-sec__plan-article">
            В текущем уроке рассматриваются аспекты работы с файлами для извлечения данных и записи результатов работы программы. Рассматриваются механизмы чтения и записи данных, режимы работы с файлами. Рассматривается такое важное понятие, как менеджер контекста, описываются частые ошибки при работе с файлами. Приведены особенности определения позиции указателя в файле, возможные параметры файловых объектов, особенности реализации печати в файл.
          </article>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          6
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 6. Объектно-ориентированное программирование
          </h4>
          <article class="course-sec__plan-article">
            Пришло время познакомиться с важнейшей парадигмой программирования — объектно-ориентированным программированием, которое играет важную роль в Python и позволяет формировать структуру программы из обособленных компонентов. Важные понятия парадигмы — класс, конструктор, атрибут, метод, экземпляр класса. Также в рамках в урока разбираются важнейшие свойства ООП: инкапсуляция, наследование и полиморфизм. Приведено описание механизмов перегрузки и переопределения методов.
          </article>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          7
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 7. ООП. Продвинутый уровень
            <article class="course-sec__plan-article">
              На этом уроке разберем особенности реализации перегрузки операторов, т. е., изменения механизма работы операторов языка посредством специальных методов. Также в рамках текущего задания мы познакомимся с понятием переопределения метода, т. е., научимся модифицировать логику методов базовых классов. Мы познакомимся с понятием интерфейса и научимся создавать собственные объекты-итераторы. В конце урока мы узнаем, для чего используется декоратор @property и важнейшие особенности воплощения парадигмы ООП в Python.
            </article>
          </h4>
        </div>
      </li>
      <li class="course-sec__plan-item">
        <div class="list-number">
          8
        </div>
        <div class="course-sec__plan-content">
          <h4 class="course-sec__plan-title">
            Урок 8. ООП. Полезные дополнения
            <article class="course-sec__plan-article">
              Восьмой урок курса посвящен важным дополнениям, расширяющим возможности парадигмы ООП в Python, например о статических методах и методах класса. Кроме того, мы поговорим о встроенных атрибутах и методах, присущих классам. В данном уроке мы также рассмотрим пошаговый процесс написания несложной программы на основе парадигмы ООП и научимся создавать собственные исключения. В завершение урока мы поговорим о некоторых трюках, которые позволят сделать ваш код более лаконичным, и изучим ряд полезных библиотек.
            </article>
          </h4>
        </div>
      </li>
    </ul>
  </div>
</template>
<script src="./course-programm.js"></script>
<style scoped src="./course-programm.css"></style>
